ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/adc.h
/*
 * Component description for ADC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_ADC_COMPONENT_H_
#define _SAMD21_ADC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ADC                                          */
/* ************************************************************************** */

/* -------- ADC_CTRLA : (ADC Offset: 0x00) (R/W 8) Control A -------- */
#define ADC_CTRLA_RESETVALUE _UINT8_(0x00) /*  (ADC_CTRLA) Control A  Reset Value */

#define ADC_CTRLA_SWRST_Pos _UINT8_(0) /* (ADC_CTRLA) Software Reset Position */
#define ADC_CTRLA_SWRST_Msk (_UINT8_(0x1) << ADC_CTRLA_SWRST_Pos) /* (ADC_CTRLA) Software Reset Mask */
#define ADC_CTRLA_SWRST(value)                                                                                         \
        (ADC_CTRLA_SWRST_Msk &                                                                                         \
         (_UINT8_(value) << ADC_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the ADC_CTRLA register */
#define ADC_CTRLA_ENABLE_Pos _UINT8_(1) /* (ADC_CTRLA) Enable Position */
#define ADC_CTRLA_ENABLE_Msk (_UINT8_(0x1) << ADC_CTRLA_ENABLE_Pos) /* (ADC_CTRLA) Enable Mask */
#define ADC_CTRLA_ENABLE(value)                                                                                        \
        (ADC_CTRLA_ENABLE_Msk &                                                                                        \
         (_UINT8_(value) << ADC_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the ADC_CTRLA register */
#define ADC_CTRLA_RUNSTDBY_Pos _UINT8_(2) /* (ADC_CTRLA) Run in Standby Position */
#define ADC_CTRLA_RUNSTDBY_Msk (_UINT8_(0x1) << ADC_CTRLA_RUNSTDBY_Pos) /* (ADC_CTRLA) Run in Standby Mask */
#define ADC_CTRLA_RUNSTDBY(value)                                                                                      \
        (ADC_CTRLA_RUNSTDBY_Msk &                                                                                      \
         (_UINT8_(value) << ADC_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the ADC_CTRLA register */
#define ADC_CTRLA_Msk _UINT8_(0x07) /* (ADC_CTRLA) Register Mask  */


/* -------- ADC_REFCTRL : (ADC Offset: 0x01) (R/W 8) Reference Control -------- */
#define ADC_REFCTRL_RESETVALUE _UINT8_(0x00) /*  (ADC_REFCTRL) Reference Control  Reset Value */

#define ADC_REFCTRL_REFSEL_Pos _UINT8_(0) /* (ADC_REFCTRL) Reference Selection Position */
#define ADC_REFCTRL_REFSEL_Msk (_UINT8_(0xF) << ADC_REFCTRL_REFSEL_Pos) /* (ADC_REFCTRL) Reference Selection Mask */
#define ADC_REFCTRL_REFSEL(value)                                                                                      \
        (ADC_REFCTRL_REFSEL_Msk &                                                                                      \
         (_UINT8_(value) << ADC_REFCTRL_REFSEL_Pos)) /* Assigment of value for REFSEL in the ADC_REFCTRL register */
#define ADC_REFCTRL_REFSEL_INT1V_Val _UINT8_(0x0) /* (ADC_REFCTRL) 1.0V voltage reference  */
#define ADC_REFCTRL_REFSEL_INTVCC0_Val _UINT8_(0x1) /* (ADC_REFCTRL) 1/1.48 VDDANA  */
#define ADC_REFCTRL_REFSEL_INTVCC1_Val _UINT8_(0x2) /* (ADC_REFCTRL) 1/2 VDDANA (only for VDDANA > 2.0V)  */
#define ADC_REFCTRL_REFSEL_AREFA_Val _UINT8_(0x3) /* (ADC_REFCTRL) External reference A  */
#define ADC_REFCTRL_REFSEL_AREFB_Val _UINT8_(0x4) /* (ADC_REFCTRL) External reference B  */
#define ADC_REFCTRL_REFSEL_INT1V                                                                                       \
        (ADC_REFCTRL_REFSEL_INT1V_Val << ADC_REFCTRL_REFSEL_Pos) /* (ADC_REFCTRL) 1.0V voltage reference Position  */
#define ADC_REFCTRL_REFSEL_INTVCC0                                                                                     \
        (ADC_REFCTRL_REFSEL_INTVCC0_Val << ADC_REFCTRL_REFSEL_Pos) /* (ADC_REFCTRL) 1/1.48 VDDANA Position  */
#define ADC_REFCTRL_REFSEL_INTVCC1                                                                                     \
        (                                                                                                              \
                ADC_REFCTRL_REFSEL_INTVCC1_Val                                                                         \
                << ADC_REFCTRL_REFSEL_Pos) /* (ADC_REFCTRL) 1/2 VDDANA (only for VDDANA > 2.0V) Position  */
#define ADC_REFCTRL_REFSEL_AREFA                                                                                       \
        (ADC_REFCTRL_REFSEL_AREFA_Val << ADC_REFCTRL_REFSEL_Pos) /* (ADC_REFCTRL) External reference A Position  */
#define ADC_REFCTRL_REFSEL_AREFB                                                                                       \
        (ADC_REFCTRL_REFSEL_AREFB_Val << ADC_REFCTRL_REFSEL_Pos) /* (ADC_REFCTRL) External reference B Position  */
#define ADC_REFCTRL_REFCOMP_Pos _UINT8_(7) /* (ADC_REFCTRL) Reference Buffer Offset Compensation Enable Position */
#define ADC_REFCTRL_REFCOMP_Msk                                                                                        \
        (_UINT8_(0x1) << ADC_REFCTRL_REFCOMP_Pos) /* (ADC_REFCTRL) Reference Buffer Offset Compensation Enable Mask */
#define ADC_REFCTRL_REFCOMP(value)                                                                                     \
        (ADC_REFCTRL_REFCOMP_Msk &                                                                                     \
         (_UINT8_(value) << ADC_REFCTRL_REFCOMP_Pos)) /* Assigment of value for REFCOMP in the ADC_REFCTRL register */
#define ADC_REFCTRL_Msk _UINT8_(0x8F) /* (ADC_REFCTRL) Register Mask  */


