ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/adc.h
/* -------- ADC_CTRLB : (ADC Offset: 0x04) (R/W 16) Control B -------- */
#define ADC_CTRLB_RESETVALUE _UINT16_(0x00) /*  (ADC_CTRLB) Control B  Reset Value */

#define ADC_CTRLB_DIFFMODE_Pos _UINT16_(0) /* (ADC_CTRLB) Differential Mode Position */
#define ADC_CTRLB_DIFFMODE_Msk (_UINT16_(0x1) << ADC_CTRLB_DIFFMODE_Pos) /* (ADC_CTRLB) Differential Mode Mask */
#define ADC_CTRLB_DIFFMODE(value)                                                                                      \
        (ADC_CTRLB_DIFFMODE_Msk &                                                                                      \
         (_UINT16_(value) << ADC_CTRLB_DIFFMODE_Pos)) /* Assigment of value for DIFFMODE in the ADC_CTRLB register */
#define ADC_CTRLB_LEFTADJ_Pos _UINT16_(1) /* (ADC_CTRLB) Left-Adjusted Result Position */
#define ADC_CTRLB_LEFTADJ_Msk (_UINT16_(0x1) << ADC_CTRLB_LEFTADJ_Pos) /* (ADC_CTRLB) Left-Adjusted Result Mask */
#define ADC_CTRLB_LEFTADJ(value)                                                                                       \
        (ADC_CTRLB_LEFTADJ_Msk &                                                                                       \
         (_UINT16_(value) << ADC_CTRLB_LEFTADJ_Pos)) /* Assigment of value for LEFTADJ in the ADC_CTRLB register */
#define ADC_CTRLB_FREERUN_Pos _UINT16_(2) /* (ADC_CTRLB) Free Running Mode Position */
#define ADC_CTRLB_FREERUN_Msk (_UINT16_(0x1) << ADC_CTRLB_FREERUN_Pos) /* (ADC_CTRLB) Free Running Mode Mask */
#define ADC_CTRLB_FREERUN(value)                                                                                       \
        (ADC_CTRLB_FREERUN_Msk &                                                                                       \
         (_UINT16_(value) << ADC_CTRLB_FREERUN_Pos)) /* Assigment of value for FREERUN in the ADC_CTRLB register */
#define ADC_CTRLB_CORREN_Pos _UINT16_(3) /* (ADC_CTRLB) Digital Correction Logic Enabled Position */
#define ADC_CTRLB_CORREN_Msk                                                                                           \
        (_UINT16_(0x1) << ADC_CTRLB_CORREN_Pos) /* (ADC_CTRLB) Digital Correction Logic Enabled Mask */
#define ADC_CTRLB_CORREN(value)                                                                                        \
        (ADC_CTRLB_CORREN_Msk &                                                                                        \
         (_UINT16_(value) << ADC_CTRLB_CORREN_Pos)) /* Assigment of value for CORREN in the ADC_CTRLB register */
#define ADC_CTRLB_RESSEL_Pos _UINT16_(4) /* (ADC_CTRLB) Conversion Result Resolution Position */
#define ADC_CTRLB_RESSEL_Msk (_UINT16_(0x3) << ADC_CTRLB_RESSEL_Pos) /* (ADC_CTRLB) Conversion Result Resolution Mask  \
                                                                      */
#define ADC_CTRLB_RESSEL(value)                                                                                        \
        (ADC_CTRLB_RESSEL_Msk &                                                                                        \
         (_UINT16_(value) << ADC_CTRLB_RESSEL_Pos)) /* Assigment of value for RESSEL in the ADC_CTRLB register */
#define ADC_CTRLB_RESSEL_12BIT_Val _UINT16_(0x0) /* (ADC_CTRLB) 12-bit result  */
#define ADC_CTRLB_RESSEL_16BIT_Val _UINT16_(0x1) /* (ADC_CTRLB) 16-bit averaging mode  */
#define ADC_CTRLB_RESSEL_10BIT_Val _UINT16_(0x2) /* (ADC_CTRLB) 10-bit result  */
#define ADC_CTRLB_RESSEL_8BIT_Val _UINT16_(0x3) /* (ADC_CTRLB) 8-bit result  */
#define ADC_CTRLB_RESSEL_12BIT                                                                                         \
        (ADC_CTRLB_RESSEL_12BIT_Val << ADC_CTRLB_RESSEL_Pos) /* (ADC_CTRLB) 12-bit result Position  */
#define ADC_CTRLB_RESSEL_16BIT                                                                                         \
        (ADC_CTRLB_RESSEL_16BIT_Val << ADC_CTRLB_RESSEL_Pos) /* (ADC_CTRLB) 16-bit averaging mode Position  */
#define ADC_CTRLB_RESSEL_10BIT                                                                                         \
        (ADC_CTRLB_RESSEL_10BIT_Val << ADC_CTRLB_RESSEL_Pos) /* (ADC_CTRLB) 10-bit result Position  */
#define ADC_CTRLB_RESSEL_8BIT                                                                                          \
        (ADC_CTRLB_RESSEL_8BIT_Val << ADC_CTRLB_RESSEL_Pos) /* (ADC_CTRLB) 8-bit result Position  */
#define ADC_CTRLB_PRESCALER_Pos _UINT16_(8) /* (ADC_CTRLB) Prescaler Configuration Position */
#define ADC_CTRLB_PRESCALER_Msk                                                                                        \
        (_UINT16_(0x7) << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Prescaler Configuration Mask */
#define ADC_CTRLB_PRESCALER(value)                                                                                     \
        (ADC_CTRLB_PRESCALER_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << ADC_CTRLB_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the ADC_CTRLB register */
#define ADC_CTRLB_PRESCALER_DIV4_Val _UINT16_(0x0) /* (ADC_CTRLB) Peripheral clock divided by 4  */
#define ADC_CTRLB_PRESCALER_DIV8_Val _UINT16_(0x1) /* (ADC_CTRLB) Peripheral clock divided by 8  */
#define ADC_CTRLB_PRESCALER_DIV16_Val _UINT16_(0x2) /* (ADC_CTRLB) Peripheral clock divided by 16  */
#define ADC_CTRLB_PRESCALER_DIV32_Val _UINT16_(0x3) /* (ADC_CTRLB) Peripheral clock divided by 32  */
#define ADC_CTRLB_PRESCALER_DIV64_Val _UINT16_(0x4) /* (ADC_CTRLB) Peripheral clock divided by 64  */
#define ADC_CTRLB_PRESCALER_DIV128_Val _UINT16_(0x5) /* (ADC_CTRLB) Peripheral clock divided by 128  */
#define ADC_CTRLB_PRESCALER_DIV256_Val _UINT16_(0x6) /* (ADC_CTRLB) Peripheral clock divided by 256  */
#define ADC_CTRLB_PRESCALER_DIV512_Val _UINT16_(0x7) /* (ADC_CTRLB) Peripheral clock divided by 512  */
#define ADC_CTRLB_PRESCALER_DIV4                                                                                       \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV4_Val                                                                           \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 4 Position  */
#define ADC_CTRLB_PRESCALER_DIV8                                                                                       \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV8_Val                                                                           \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 8 Position  */
#define ADC_CTRLB_PRESCALER_DIV16                                                                                      \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV16_Val                                                                          \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 16 Position  */
#define ADC_CTRLB_PRESCALER_DIV32                                                                                      \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV32_Val                                                                          \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 32 Position  */
#define ADC_CTRLB_PRESCALER_DIV64                                                                                      \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV64_Val                                                                          \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 64 Position  */
#define ADC_CTRLB_PRESCALER_DIV128                                                                                     \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV128_Val                                                                         \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 128 Position  */
#define ADC_CTRLB_PRESCALER_DIV256                                                                                     \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV256_Val                                                                         \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 256 Position  */
#define ADC_CTRLB_PRESCALER_DIV512                                                                                     \
        (                                                                                                              \
                ADC_CTRLB_PRESCALER_DIV512_Val                                                                         \
                << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) Peripheral clock divided by 512 Position  */
#define ADC_CTRLB_Msk _UINT16_(0x073F) /* (ADC_CTRLB) Register Mask  */


/* -------- ADC_WINCTRL : (ADC Offset: 0x08) (R/W 8) Window Monitor Control -------- */
#define ADC_WINCTRL_RESETVALUE _UINT8_(0x00) /*  (ADC_WINCTRL) Window Monitor Control  Reset Value */

