ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/adc.h
#define ADC_WINCTRL_WINMODE_Pos _UINT8_(0) /* (ADC_WINCTRL) Window Monitor Mode Position */
#define ADC_WINCTRL_WINMODE_Msk (_UINT8_(0x7) << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) Window Monitor Mode Mask */
#define ADC_WINCTRL_WINMODE(value)                                                                                     \
        (ADC_WINCTRL_WINMODE_Msk &                                                                                     \
         (_UINT8_(value) << ADC_WINCTRL_WINMODE_Pos)) /* Assigment of value for WINMODE in the ADC_WINCTRL register */
#define ADC_WINCTRL_WINMODE_DISABLE_Val _UINT8_(0x0) /* (ADC_WINCTRL) No window mode (default)  */
#define ADC_WINCTRL_WINMODE_MODE1_Val _UINT8_(0x1) /* (ADC_WINCTRL) Mode 1: RESULT > WINLT  */
#define ADC_WINCTRL_WINMODE_MODE2_Val _UINT8_(0x2) /* (ADC_WINCTRL) Mode 2: RESULT < WINUT  */
#define ADC_WINCTRL_WINMODE_MODE3_Val _UINT8_(0x3) /* (ADC_WINCTRL) Mode 3: WINLT < RESULT < WINUT  */
#define ADC_WINCTRL_WINMODE_MODE4_Val _UINT8_(0x4) /* (ADC_WINCTRL) Mode 4: !(WINLT < RESULT < WINUT)  */
#define ADC_WINCTRL_WINMODE_DISABLE                                                                                    \
        (                                                                                                              \
                ADC_WINCTRL_WINMODE_DISABLE_Val                                                                        \
                << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) No window mode (default) Position  */
#define ADC_WINCTRL_WINMODE_MODE1                                                                                      \
        (ADC_WINCTRL_WINMODE_MODE1_Val << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) Mode 1: RESULT > WINLT Position */
#define ADC_WINCTRL_WINMODE_MODE2                                                                                      \
        (ADC_WINCTRL_WINMODE_MODE2_Val << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) Mode 2: RESULT < WINUT Position */
#define ADC_WINCTRL_WINMODE_MODE3                                                                                      \
        (                                                                                                              \
                ADC_WINCTRL_WINMODE_MODE3_Val                                                                          \
                << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) Mode 3: WINLT < RESULT < WINUT Position  */
#define ADC_WINCTRL_WINMODE_MODE4                                                                                      \
        (                                                                                                              \
                ADC_WINCTRL_WINMODE_MODE4_Val                                                                          \
                << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) Mode 4: !(WINLT < RESULT < WINUT) Position  */
#define ADC_WINCTRL_Msk _UINT8_(0x07) /* (ADC_WINCTRL) Register Mask  */


/* -------- ADC_SWTRIG : (ADC Offset: 0x0C) (R/W 8) Software Trigger -------- */
#define ADC_SWTRIG_RESETVALUE _UINT8_(0x00) /*  (ADC_SWTRIG) Software Trigger  Reset Value */

#define ADC_SWTRIG_FLUSH_Pos _UINT8_(0) /* (ADC_SWTRIG) ADC Conversion Flush Position */
#define ADC_SWTRIG_FLUSH_Msk (_UINT8_(0x1) << ADC_SWTRIG_FLUSH_Pos) /* (ADC_SWTRIG) ADC Conversion Flush Mask */
#define ADC_SWTRIG_FLUSH(value)                                                                                        \
        (ADC_SWTRIG_FLUSH_Msk &                                                                                        \
         (_UINT8_(value) << ADC_SWTRIG_FLUSH_Pos)) /* Assigment of value for FLUSH in the ADC_SWTRIG register */
#define ADC_SWTRIG_START_Pos _UINT8_(1) /* (ADC_SWTRIG) ADC Start Conversion Position */
#define ADC_SWTRIG_START_Msk (_UINT8_(0x1) << ADC_SWTRIG_START_Pos) /* (ADC_SWTRIG) ADC Start Conversion Mask */
#define ADC_SWTRIG_START(value)                                                                                        \
        (ADC_SWTRIG_START_Msk &                                                                                        \
         (_UINT8_(value) << ADC_SWTRIG_START_Pos)) /* Assigment of value for START in the ADC_SWTRIG register */
#define ADC_SWTRIG_Msk _UINT8_(0x03) /* (ADC_SWTRIG) Register Mask  */


/* -------- ADC_INPUTCTRL : (ADC Offset: 0x10) (R/W 32) Input Control -------- */
#define ADC_INPUTCTRL_RESETVALUE _UINT32_(0x00) /*  (ADC_INPUTCTRL) Input Control  Reset Value */

#define ADC_INPUTCTRL_MUXPOS_Pos _UINT32_(0) /* (ADC_INPUTCTRL) Positive Mux Input Selection Position */
#define ADC_INPUTCTRL_MUXPOS_Msk                                                                                       \
        (_UINT32_(0x1F) << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Positive Mux Input Selection Mask */
#define ADC_INPUTCTRL_MUXPOS(value)                                                                                    \
        (ADC_INPUTCTRL_MUXPOS_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << ADC_INPUTCTRL_MUXPOS_Pos)) /* Assigment of value for MUXPOS in the ADC_INPUTCTRL register */
#define ADC_INPUTCTRL_MUXPOS_PIN0_Val _UINT32_(0x0) /* (ADC_INPUTCTRL) ADC AIN0 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN1_Val _UINT32_(0x1) /* (ADC_INPUTCTRL) ADC AIN1 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN2_Val _UINT32_(0x2) /* (ADC_INPUTCTRL) ADC AIN2 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN3_Val _UINT32_(0x3) /* (ADC_INPUTCTRL) ADC AIN3 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN4_Val _UINT32_(0x4) /* (ADC_INPUTCTRL) ADC AIN4 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN5_Val _UINT32_(0x5) /* (ADC_INPUTCTRL) ADC AIN5 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN6_Val _UINT32_(0x6) /* (ADC_INPUTCTRL) ADC AIN6 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN7_Val _UINT32_(0x7) /* (ADC_INPUTCTRL) ADC AIN7 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN8_Val _UINT32_(0x8) /* (ADC_INPUTCTRL) ADC AIN8 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN9_Val _UINT32_(0x9) /* (ADC_INPUTCTRL) ADC AIN9 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN10_Val _UINT32_(0xA) /* (ADC_INPUTCTRL) ADC AIN10 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN11_Val _UINT32_(0xB) /* (ADC_INPUTCTRL) ADC AIN11 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN12_Val _UINT32_(0xC) /* (ADC_INPUTCTRL) ADC AIN12 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN13_Val _UINT32_(0xD) /* (ADC_INPUTCTRL) ADC AIN13 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN14_Val _UINT32_(0xE) /* (ADC_INPUTCTRL) ADC AIN14 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN15_Val _UINT32_(0xF) /* (ADC_INPUTCTRL) ADC AIN15 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN16_Val _UINT32_(0x10) /* (ADC_INPUTCTRL) ADC AIN16 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN17_Val _UINT32_(0x11) /* (ADC_INPUTCTRL) ADC AIN17 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN18_Val _UINT32_(0x12) /* (ADC_INPUTCTRL) ADC AIN18 Pin  */
#define ADC_INPUTCTRL_MUXPOS_PIN19_Val _UINT32_(0x13) /* (ADC_INPUTCTRL) ADC AIN19 Pin  */
#define ADC_INPUTCTRL_MUXPOS_TEMP_Val _UINT32_(0x18) /* (ADC_INPUTCTRL) Temperature Reference  */
#define ADC_INPUTCTRL_MUXPOS_BANDGAP_Val _UINT32_(0x19) /* (ADC_INPUTCTRL) Bandgap Voltage  */
#define ADC_INPUTCTRL_MUXPOS_SCALEDCOREVCC_Val _UINT32_(0x1A) /* (ADC_INPUTCTRL) 1/4  Scaled Core Supply  */
#define ADC_INPUTCTRL_MUXPOS_SCALEDIOVCC_Val _UINT32_(0x1B) /* (ADC_INPUTCTRL) 1/4  Scaled I/O Supply  */
#define ADC_INPUTCTRL_MUXPOS_DAC_Val _UINT32_(0x1C) /* (ADC_INPUTCTRL) DAC Output  */
#define ADC_INPUTCTRL_MUXPOS_PIN0                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN0_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN0 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN1                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN1_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN1 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN2                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN2_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN2 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN3                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN3_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN3 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN4                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN4_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN4 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN5                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN5_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN5 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN6                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN6_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN6 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN7                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN7_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN7 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN8                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN8_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN8 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN9                                                                                      \
        (ADC_INPUTCTRL_MUXPOS_PIN9_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN9 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN10                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN10_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN10 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN11                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN11_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN11 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN12                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN12_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN12 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN13                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN13_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN13 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN14                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN14_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN14 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN15                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN15_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN15 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN16                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN16_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN16 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN17                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN17_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN17 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN18                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN18_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN18 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_PIN19                                                                                     \
        (ADC_INPUTCTRL_MUXPOS_PIN19_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN19 Pin Position  */
#define ADC_INPUTCTRL_MUXPOS_TEMP                                                                                      \
        (                                                                                                              \
                ADC_INPUTCTRL_MUXPOS_TEMP_Val                                                                          \
                << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Temperature Reference Position  */
#define ADC_INPUTCTRL_MUXPOS_BANDGAP                                                                                   \
        (ADC_INPUTCTRL_MUXPOS_BANDGAP_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Bandgap Voltage Position  */
#define ADC_INPUTCTRL_MUXPOS_SCALEDCOREVCC                                                                             \
        (ADC_INPUTCTRL_MUXPOS_SCALEDCOREVCC_Val                                                                        \
         << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) 1/4  Scaled Core Supply Position  */
#define ADC_INPUTCTRL_MUXPOS_SCALEDIOVCC                                                                               \
        (ADC_INPUTCTRL_MUXPOS_SCALEDIOVCC_Val                                                                          \
         << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) 1/4  Scaled I/O Supply Position  */
#define ADC_INPUTCTRL_MUXPOS_DAC                                                                                       \
        (ADC_INPUTCTRL_MUXPOS_DAC_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) DAC Output Position  */
#define ADC_INPUTCTRL_MUXNEG_Pos _UINT32_(8) /* (ADC_INPUTCTRL) Negative Mux Input Selection Position */
#define ADC_INPUTCTRL_MUXNEG_Msk                                                                                       \
        (_UINT32_(0x1F) << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) Negative Mux Input Selection Mask */
#define ADC_INPUTCTRL_MUXNEG(value)                                                                                    \
        (ADC_INPUTCTRL_MUXNEG_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << ADC_INPUTCTRL_MUXNEG_Pos)) /* Assigment of value for MUXNEG in the ADC_INPUTCTRL register */
#define ADC_INPUTCTRL_MUXNEG_PIN0_Val _UINT32_(0x0) /* (ADC_INPUTCTRL) ADC AIN0 Pin  */
#define ADC_INPUTCTRL_MUXNEG_PIN1_Val _UINT32_(0x1) /* (ADC_INPUTCTRL) ADC AIN1 Pin  */
#define ADC_INPUTCTRL_MUXNEG_PIN2_Val _UINT32_(0x2) /* (ADC_INPUTCTRL) ADC AIN2 Pin  */
#define ADC_INPUTCTRL_MUXNEG_PIN3_Val _UINT32_(0x3) /* (ADC_INPUTCTRL) ADC AIN3 Pin  */
#define ADC_INPUTCTRL_MUXNEG_PIN4_Val _UINT32_(0x4) /* (ADC_INPUTCTRL) ADC AIN4 Pin  */
#define ADC_INPUTCTRL_MUXNEG_PIN5_Val _UINT32_(0x5) /* (ADC_INPUTCTRL) ADC AIN5 Pin  */
#define ADC_INPUTCTRL_MUXNEG_PIN6_Val _UINT32_(0x6) /* (ADC_INPUTCTRL) ADC AIN6 Pin  */
#define ADC_INPUTCTRL_MUXNEG_PIN7_Val _UINT32_(0x7) /* (ADC_INPUTCTRL) ADC AIN7 Pin  */
#define ADC_INPUTCTRL_MUXNEG_GND_Val _UINT32_(0x18) /* (ADC_INPUTCTRL) Internal Ground  */
#define ADC_INPUTCTRL_MUXNEG_IOGND_Val _UINT32_(0x19) /* (ADC_INPUTCTRL) I/O Ground  */
#define ADC_INPUTCTRL_MUXNEG_PIN0                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN0_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN0 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_PIN1                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN1_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN1 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_PIN2                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN2_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN2 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_PIN3                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN3_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN3 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_PIN4                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN4_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN4 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_PIN5                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN5_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN5 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_PIN6                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN6_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN6 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_PIN7                                                                                      \
        (ADC_INPUTCTRL_MUXNEG_PIN7_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN7 Pin Position  */
#define ADC_INPUTCTRL_MUXNEG_GND                                                                                       \
        (ADC_INPUTCTRL_MUXNEG_GND_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) Internal Ground Position  */
#define ADC_INPUTCTRL_MUXNEG_IOGND                                                                                     \
        (ADC_INPUTCTRL_MUXNEG_IOGND_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) I/O Ground Position  */
#define ADC_INPUTCTRL_INPUTSCAN_Pos                                                                                    \
        _UINT32_(16) /* (ADC_INPUTCTRL) Number of Input Channels Included in Scan Position */
#define ADC_INPUTCTRL_INPUTSCAN_Msk                                                                                    \
        (_UINT32_(0xF)                                                                                                 \
         << ADC_INPUTCTRL_INPUTSCAN_Pos) /* (ADC_INPUTCTRL) Number of Input Channels Included in Scan Mask */
#define ADC_INPUTCTRL_INPUTSCAN(value)                                                                                 \
        (ADC_INPUTCTRL_INPUTSCAN_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << ADC_INPUTCTRL_INPUTSCAN_Pos)) /* Assigment of value for INPUTSCAN in the ADC_INPUTCTRL register */
#define ADC_INPUTCTRL_INPUTOFFSET_Pos _UINT32_(20) /* (ADC_INPUTCTRL) Positive Mux Setting Offset Position */
#define ADC_INPUTCTRL_INPUTOFFSET_Msk                                                                                  \
        (_UINT32_(0xF) << ADC_INPUTCTRL_INPUTOFFSET_Pos) /* (ADC_INPUTCTRL) Positive Mux Setting Offset Mask */
#define ADC_INPUTCTRL_INPUTOFFSET(value)                                                                               \
        (ADC_INPUTCTRL_INPUTOFFSET_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << ADC_INPUTCTRL_INPUTOFFSET_Pos)) /* Assigment of value for INPUTOFFSET in the ADC_INPUTCTRL register */
#define ADC_INPUTCTRL_GAIN_Pos _UINT32_(24) /* (ADC_INPUTCTRL) Gain Factor Selection Position */
#define ADC_INPUTCTRL_GAIN_Msk                                                                                         \
        (_UINT32_(0xF) << ADC_INPUTCTRL_GAIN_Pos) /* (ADC_INPUTCTRL) Gain Factor Selection Mask */
#define ADC_INPUTCTRL_GAIN(value)                                                                                      \
        (ADC_INPUTCTRL_GAIN_Msk &                                                                                      \
         (_UINT32_(value) << ADC_INPUTCTRL_GAIN_Pos)) /* Assigment of value for GAIN in the ADC_INPUTCTRL register */
#define ADC_INPUTCTRL_GAIN_1X_Val _UINT32_(0x0) /* (ADC_INPUTCTRL) 1x  */
#define ADC_INPUTCTRL_GAIN_2X_Val _UINT32_(0x1) /* (ADC_INPUTCTRL) 2x  */
#define ADC_INPUTCTRL_GAIN_4X_Val _UINT32_(0x2) /* (ADC_INPUTCTRL) 4x  */
#define ADC_INPUTCTRL_GAIN_8X_Val _UINT32_(0x3) /* (ADC_INPUTCTRL) 8x  */
#define ADC_INPUTCTRL_GAIN_16X_Val _UINT32_(0x4) /* (ADC_INPUTCTRL) 16x  */
#define ADC_INPUTCTRL_GAIN_DIV2_Val _UINT32_(0xF) /* (ADC_INPUTCTRL) 1/2x  */
#define ADC_INPUTCTRL_GAIN_1X (ADC_INPUTCTRL_GAIN_1X_Val << ADC_INPUTCTRL_GAIN_Pos) /* (ADC_INPUTCTRL) 1x Position  */
#define ADC_INPUTCTRL_GAIN_2X (ADC_INPUTCTRL_GAIN_2X_Val << ADC_INPUTCTRL_GAIN_Pos) /* (ADC_INPUTCTRL) 2x Position  */
#define ADC_INPUTCTRL_GAIN_4X (ADC_INPUTCTRL_GAIN_4X_Val << ADC_INPUTCTRL_GAIN_Pos) /* (ADC_INPUTCTRL) 4x Position  */
#define ADC_INPUTCTRL_GAIN_8X (ADC_INPUTCTRL_GAIN_8X_Val << ADC_INPUTCTRL_GAIN_Pos) /* (ADC_INPUTCTRL) 8x Position  */
#define ADC_INPUTCTRL_GAIN_16X                                                                                         \
        (ADC_INPUTCTRL_GAIN_16X_Val << ADC_INPUTCTRL_GAIN_Pos) /* (ADC_INPUTCTRL) 16x Position  */
#define ADC_INPUTCTRL_GAIN_DIV2                                                                                        \
        (ADC_INPUTCTRL_GAIN_DIV2_Val << ADC_INPUTCTRL_GAIN_Pos) /* (ADC_INPUTCTRL) 1/2x Position  */
#define ADC_INPUTCTRL_Msk _UINT32_(0x0FFF1F1F) /* (ADC_INPUTCTRL) Register Mask  */


