ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/adc.h
/* -------- ADC_EVCTRL : (ADC Offset: 0x14) (R/W 8) Event Control -------- */
#define ADC_EVCTRL_RESETVALUE _UINT8_(0x00) /*  (ADC_EVCTRL) Event Control  Reset Value */

#define ADC_EVCTRL_STARTEI_Pos _UINT8_(0) /* (ADC_EVCTRL) Start Conversion Event In Position */
#define ADC_EVCTRL_STARTEI_Msk                                                                                         \
        (_UINT8_(0x1) << ADC_EVCTRL_STARTEI_Pos) /* (ADC_EVCTRL) Start Conversion Event In Mask */
#define ADC_EVCTRL_STARTEI(value)                                                                                      \
        (ADC_EVCTRL_STARTEI_Msk &                                                                                      \
         (_UINT8_(value) << ADC_EVCTRL_STARTEI_Pos)) /* Assigment of value for STARTEI in the ADC_EVCTRL register */
#define ADC_EVCTRL_SYNCEI_Pos _UINT8_(1) /* (ADC_EVCTRL) Synchronization Event In Position */
#define ADC_EVCTRL_SYNCEI_Msk (_UINT8_(0x1) << ADC_EVCTRL_SYNCEI_Pos) /* (ADC_EVCTRL) Synchronization Event In Mask */
#define ADC_EVCTRL_SYNCEI(value)                                                                                       \
        (ADC_EVCTRL_SYNCEI_Msk &                                                                                       \
         (_UINT8_(value) << ADC_EVCTRL_SYNCEI_Pos)) /* Assigment of value for SYNCEI in the ADC_EVCTRL register */
#define ADC_EVCTRL_RESRDYEO_Pos _UINT8_(4) /* (ADC_EVCTRL) Result Ready Event Out Position */
#define ADC_EVCTRL_RESRDYEO_Msk (_UINT8_(0x1) << ADC_EVCTRL_RESRDYEO_Pos) /* (ADC_EVCTRL) Result Ready Event Out Mask  \
                                                                           */
#define ADC_EVCTRL_RESRDYEO(value)                                                                                     \
        (ADC_EVCTRL_RESRDYEO_Msk &                                                                                     \
         (_UINT8_(value) << ADC_EVCTRL_RESRDYEO_Pos)) /* Assigment of value for RESRDYEO in the ADC_EVCTRL register */
#define ADC_EVCTRL_WINMONEO_Pos _UINT8_(5) /* (ADC_EVCTRL) Window Monitor Event Out Position */
#define ADC_EVCTRL_WINMONEO_Msk                                                                                        \
        (_UINT8_(0x1) << ADC_EVCTRL_WINMONEO_Pos) /* (ADC_EVCTRL) Window Monitor Event Out Mask */
#define ADC_EVCTRL_WINMONEO(value)                                                                                     \
        (ADC_EVCTRL_WINMONEO_Msk &                                                                                     \
         (_UINT8_(value) << ADC_EVCTRL_WINMONEO_Pos)) /* Assigment of value for WINMONEO in the ADC_EVCTRL register */
#define ADC_EVCTRL_Msk _UINT8_(0x33) /* (ADC_EVCTRL) Register Mask  */


/* -------- ADC_INTENCLR : (ADC Offset: 0x16) (R/W 8) Interrupt Enable Clear -------- */
#define ADC_INTENCLR_RESETVALUE _UINT8_(0x00) /*  (ADC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define ADC_INTENCLR_RESRDY_Pos _UINT8_(0) /* (ADC_INTENCLR) Result Ready Interrupt Enable Position */
#define ADC_INTENCLR_RESRDY_Msk                                                                                        \
        (_UINT8_(0x1) << ADC_INTENCLR_RESRDY_Pos) /* (ADC_INTENCLR) Result Ready Interrupt Enable Mask */
#define ADC_INTENCLR_RESRDY(value)                                                                                     \
        (ADC_INTENCLR_RESRDY_Msk &                                                                                     \
         (_UINT8_(value) << ADC_INTENCLR_RESRDY_Pos)) /* Assigment of value for RESRDY in the ADC_INTENCLR register */
#define ADC_INTENCLR_OVERRUN_Pos _UINT8_(1) /* (ADC_INTENCLR) Overrun Interrupt Enable Position */
#define ADC_INTENCLR_OVERRUN_Msk                                                                                       \
        (_UINT8_(0x1) << ADC_INTENCLR_OVERRUN_Pos) /* (ADC_INTENCLR) Overrun Interrupt Enable Mask */
#define ADC_INTENCLR_OVERRUN(value)                                                                                    \
        (ADC_INTENCLR_OVERRUN_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << ADC_INTENCLR_OVERRUN_Pos)) /* Assigment of value for OVERRUN in the ADC_INTENCLR register */
#define ADC_INTENCLR_WINMON_Pos _UINT8_(2) /* (ADC_INTENCLR) Window Monitor Interrupt Enable Position */
#define ADC_INTENCLR_WINMON_Msk                                                                                        \
        (_UINT8_(0x1) << ADC_INTENCLR_WINMON_Pos) /* (ADC_INTENCLR) Window Monitor Interrupt Enable Mask */
#define ADC_INTENCLR_WINMON(value)                                                                                     \
        (ADC_INTENCLR_WINMON_Msk &                                                                                     \
         (_UINT8_(value) << ADC_INTENCLR_WINMON_Pos)) /* Assigment of value for WINMON in the ADC_INTENCLR register */
#define ADC_INTENCLR_SYNCRDY_Pos _UINT8_(3) /* (ADC_INTENCLR) Synchronization Ready Interrupt Enable Position */
#define ADC_INTENCLR_SYNCRDY_Msk                                                                                       \
        (_UINT8_(0x1) << ADC_INTENCLR_SYNCRDY_Pos) /* (ADC_INTENCLR) Synchronization Ready Interrupt Enable Mask */
#define ADC_INTENCLR_SYNCRDY(value)                                                                                    \
        (ADC_INTENCLR_SYNCRDY_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << ADC_INTENCLR_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the ADC_INTENCLR register */
#define ADC_INTENCLR_Msk _UINT8_(0x0F) /* (ADC_INTENCLR) Register Mask  */


/* -------- ADC_INTENSET : (ADC Offset: 0x17) (R/W 8) Interrupt Enable Set -------- */
#define ADC_INTENSET_RESETVALUE _UINT8_(0x00) /*  (ADC_INTENSET) Interrupt Enable Set  Reset Value */

#define ADC_INTENSET_RESRDY_Pos _UINT8_(0) /* (ADC_INTENSET) Result Ready Interrupt Enable Position */
#define ADC_INTENSET_RESRDY_Msk                                                                                        \
        (_UINT8_(0x1) << ADC_INTENSET_RESRDY_Pos) /* (ADC_INTENSET) Result Ready Interrupt Enable Mask */
#define ADC_INTENSET_RESRDY(value)                                                                                     \
        (ADC_INTENSET_RESRDY_Msk &                                                                                     \
         (_UINT8_(value) << ADC_INTENSET_RESRDY_Pos)) /* Assigment of value for RESRDY in the ADC_INTENSET register */
#define ADC_INTENSET_OVERRUN_Pos _UINT8_(1) /* (ADC_INTENSET) Overrun Interrupt Enable Position */
#define ADC_INTENSET_OVERRUN_Msk                                                                                       \
        (_UINT8_(0x1) << ADC_INTENSET_OVERRUN_Pos) /* (ADC_INTENSET) Overrun Interrupt Enable Mask */
#define ADC_INTENSET_OVERRUN(value)                                                                                    \
        (ADC_INTENSET_OVERRUN_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << ADC_INTENSET_OVERRUN_Pos)) /* Assigment of value for OVERRUN in the ADC_INTENSET register */
#define ADC_INTENSET_WINMON_Pos _UINT8_(2) /* (ADC_INTENSET) Window Monitor Interrupt Enable Position */
#define ADC_INTENSET_WINMON_Msk                                                                                        \
        (_UINT8_(0x1) << ADC_INTENSET_WINMON_Pos) /* (ADC_INTENSET) Window Monitor Interrupt Enable Mask */
#define ADC_INTENSET_WINMON(value)                                                                                     \
        (ADC_INTENSET_WINMON_Msk &                                                                                     \
         (_UINT8_(value) << ADC_INTENSET_WINMON_Pos)) /* Assigment of value for WINMON in the ADC_INTENSET register */
#define ADC_INTENSET_SYNCRDY_Pos _UINT8_(3) /* (ADC_INTENSET) Synchronization Ready Interrupt Enable Position */
#define ADC_INTENSET_SYNCRDY_Msk                                                                                       \
        (_UINT8_(0x1) << ADC_INTENSET_SYNCRDY_Pos) /* (ADC_INTENSET) Synchronization Ready Interrupt Enable Mask */
#define ADC_INTENSET_SYNCRDY(value)                                                                                    \
        (ADC_INTENSET_SYNCRDY_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << ADC_INTENSET_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the ADC_INTENSET register */
#define ADC_INTENSET_Msk _UINT8_(0x0F) /* (ADC_INTENSET) Register Mask  */


/* -------- ADC_INTFLAG : (ADC Offset: 0x18) (R/W 8) Interrupt Flag Status and Clear -------- */
#define ADC_INTFLAG_RESETVALUE _UINT8_(0x00) /*  (ADC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define ADC_INTFLAG_RESRDY_Pos _UINT8_(0) /* (ADC_INTFLAG) Result Ready Position */
#define ADC_INTFLAG_RESRDY_Msk (_UINT8_(0x1) << ADC_INTFLAG_RESRDY_Pos) /* (ADC_INTFLAG) Result Ready Mask */
#define ADC_INTFLAG_RESRDY(value)                                                                                      \
        (ADC_INTFLAG_RESRDY_Msk &                                                                                      \
         (_UINT8_(value) << ADC_INTFLAG_RESRDY_Pos)) /* Assigment of value for RESRDY in the ADC_INTFLAG register */
#define ADC_INTFLAG_OVERRUN_Pos _UINT8_(1) /* (ADC_INTFLAG) Overrun Position */
#define ADC_INTFLAG_OVERRUN_Msk (_UINT8_(0x1) << ADC_INTFLAG_OVERRUN_Pos) /* (ADC_INTFLAG) Overrun Mask */
#define ADC_INTFLAG_OVERRUN(value)                                                                                     \
        (ADC_INTFLAG_OVERRUN_Msk &                                                                                     \
         (_UINT8_(value) << ADC_INTFLAG_OVERRUN_Pos)) /* Assigment of value for OVERRUN in the ADC_INTFLAG register */
#define ADC_INTFLAG_WINMON_Pos _UINT8_(2) /* (ADC_INTFLAG) Window Monitor Position */
#define ADC_INTFLAG_WINMON_Msk (_UINT8_(0x1) << ADC_INTFLAG_WINMON_Pos) /* (ADC_INTFLAG) Window Monitor Mask */
#define ADC_INTFLAG_WINMON(value)                                                                                      \
        (ADC_INTFLAG_WINMON_Msk &                                                                                      \
         (_UINT8_(value) << ADC_INTFLAG_WINMON_Pos)) /* Assigment of value for WINMON in the ADC_INTFLAG register */
#define ADC_INTFLAG_SYNCRDY_Pos _UINT8_(3) /* (ADC_INTFLAG) Synchronization Ready Position */
#define ADC_INTFLAG_SYNCRDY_Msk (_UINT8_(0x1) << ADC_INTFLAG_SYNCRDY_Pos) /* (ADC_INTFLAG) Synchronization Ready Mask  \
                                                                           */
#define ADC_INTFLAG_SYNCRDY(value)                                                                                     \
        (ADC_INTFLAG_SYNCRDY_Msk &                                                                                     \
         (_UINT8_(value) << ADC_INTFLAG_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the ADC_INTFLAG register */
#define ADC_INTFLAG_Msk _UINT8_(0x0F) /* (ADC_INTFLAG) Register Mask  */


