ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/adc.h
/* -------- ADC_STATUS : (ADC Offset: 0x19) ( R/ 8) Status -------- */
#define ADC_STATUS_RESETVALUE _UINT8_(0x00) /*  (ADC_STATUS) Status  Reset Value */

#define ADC_STATUS_SYNCBUSY_Pos _UINT8_(7) /* (ADC_STATUS) Synchronization Busy Position */
#define ADC_STATUS_SYNCBUSY_Msk (_UINT8_(0x1) << ADC_STATUS_SYNCBUSY_Pos) /* (ADC_STATUS) Synchronization Busy Mask */
#define ADC_STATUS_SYNCBUSY(value)                                                                                     \
        (ADC_STATUS_SYNCBUSY_Msk &                                                                                     \
         (_UINT8_(value) << ADC_STATUS_SYNCBUSY_Pos)) /* Assigment of value for SYNCBUSY in the ADC_STATUS register */
#define ADC_STATUS_Msk _UINT8_(0x80) /* (ADC_STATUS) Register Mask  */


/* -------- ADC_RESULT : (ADC Offset: 0x1A) ( R/ 16) Result -------- */
#define ADC_RESULT_RESETVALUE _UINT16_(0x00) /*  (ADC_RESULT) Result  Reset Value */

#define ADC_RESULT_RESULT_Pos _UINT16_(0) /* (ADC_RESULT) Result Conversion Value Position */
#define ADC_RESULT_RESULT_Msk                                                                                          \
        (_UINT16_(0xFFFF) << ADC_RESULT_RESULT_Pos) /* (ADC_RESULT) Result Conversion Value Mask */
#define ADC_RESULT_RESULT(value)                                                                                       \
        (ADC_RESULT_RESULT_Msk &                                                                                       \
         (_UINT16_(value) << ADC_RESULT_RESULT_Pos)) /* Assigment of value for RESULT in the ADC_RESULT register */
#define ADC_RESULT_Msk _UINT16_(0xFFFF) /* (ADC_RESULT) Register Mask  */


/* -------- ADC_WINLT : (ADC Offset: 0x1C) (R/W 16) Window Monitor Lower Threshold -------- */
#define ADC_WINLT_RESETVALUE _UINT16_(0x00) /*  (ADC_WINLT) Window Monitor Lower Threshold  Reset Value */

#define ADC_WINLT_WINLT_Pos _UINT16_(0) /* (ADC_WINLT) Window Lower Threshold Position */
#define ADC_WINLT_WINLT_Msk (_UINT16_(0xFFFF) << ADC_WINLT_WINLT_Pos) /* (ADC_WINLT) Window Lower Threshold Mask */
#define ADC_WINLT_WINLT(value)                                                                                         \
        (ADC_WINLT_WINLT_Msk &                                                                                         \
         (_UINT16_(value) << ADC_WINLT_WINLT_Pos)) /* Assigment of value for WINLT in the ADC_WINLT register */
#define ADC_WINLT_Msk _UINT16_(0xFFFF) /* (ADC_WINLT) Register Mask  */


/* -------- ADC_WINUT : (ADC Offset: 0x20) (R/W 16) Window Monitor Upper Threshold -------- */
#define ADC_WINUT_RESETVALUE _UINT16_(0x00) /*  (ADC_WINUT) Window Monitor Upper Threshold  Reset Value */

#define ADC_WINUT_WINUT_Pos _UINT16_(0) /* (ADC_WINUT) Window Upper Threshold Position */
#define ADC_WINUT_WINUT_Msk (_UINT16_(0xFFFF) << ADC_WINUT_WINUT_Pos) /* (ADC_WINUT) Window Upper Threshold Mask */
#define ADC_WINUT_WINUT(value)                                                                                         \
        (ADC_WINUT_WINUT_Msk &                                                                                         \
         (_UINT16_(value) << ADC_WINUT_WINUT_Pos)) /* Assigment of value for WINUT in the ADC_WINUT register */
#define ADC_WINUT_Msk _UINT16_(0xFFFF) /* (ADC_WINUT) Register Mask  */


/* -------- ADC_GAINCORR : (ADC Offset: 0x24) (R/W 16) Gain Correction -------- */
#define ADC_GAINCORR_RESETVALUE _UINT16_(0x00) /*  (ADC_GAINCORR) Gain Correction  Reset Value */

#define ADC_GAINCORR_GAINCORR_Pos _UINT16_(0) /* (ADC_GAINCORR) Gain Correction Value Position */
#define ADC_GAINCORR_GAINCORR_Msk                                                                                      \
        (_UINT16_(0xFFF) << ADC_GAINCORR_GAINCORR_Pos) /* (ADC_GAINCORR) Gain Correction Value Mask */
#define ADC_GAINCORR_GAINCORR(value)                                                                                   \
        (ADC_GAINCORR_GAINCORR_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << ADC_GAINCORR_GAINCORR_Pos)) /* Assigment of value for GAINCORR in the ADC_GAINCORR register */
#define ADC_GAINCORR_Msk _UINT16_(0x0FFF) /* (ADC_GAINCORR) Register Mask  */


/* -------- ADC_OFFSETCORR : (ADC Offset: 0x26) (R/W 16) Offset Correction -------- */
#define ADC_OFFSETCORR_RESETVALUE _UINT16_(0x00) /*  (ADC_OFFSETCORR) Offset Correction  Reset Value */

#define ADC_OFFSETCORR_OFFSETCORR_Pos _UINT16_(0) /* (ADC_OFFSETCORR) Offset Correction Value Position */
#define ADC_OFFSETCORR_OFFSETCORR_Msk                                                                                  \
        (_UINT16_(0xFFF) << ADC_OFFSETCORR_OFFSETCORR_Pos) /* (ADC_OFFSETCORR) Offset Correction Value Mask */
#define ADC_OFFSETCORR_OFFSETCORR(value)                                                                               \
        (ADC_OFFSETCORR_OFFSETCORR_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << ADC_OFFSETCORR_OFFSETCORR_Pos)) /* Assigment of value for OFFSETCORR in the ADC_OFFSETCORR register */
#define ADC_OFFSETCORR_Msk _UINT16_(0x0FFF) /* (ADC_OFFSETCORR) Register Mask  */


/* -------- ADC_CALIB : (ADC Offset: 0x28) (R/W 16) Calibration -------- */
#define ADC_CALIB_RESETVALUE _UINT16_(0x00) /*  (ADC_CALIB) Calibration  Reset Value */

#define ADC_CALIB_LINEARITY_CAL_Pos _UINT16_(0) /* (ADC_CALIB) Linearity Calibration Value Position */
#define ADC_CALIB_LINEARITY_CAL_Msk                                                                                    \
        (_UINT16_(0xFF) << ADC_CALIB_LINEARITY_CAL_Pos) /* (ADC_CALIB) Linearity Calibration Value Mask */
#define ADC_CALIB_LINEARITY_CAL(value)                                                                                 \
        (ADC_CALIB_LINEARITY_CAL_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << ADC_CALIB_LINEARITY_CAL_Pos)) /* Assigment of value for LINEARITY_CAL in the ADC_CALIB register */
#define ADC_CALIB_BIAS_CAL_Pos _UINT16_(8) /* (ADC_CALIB) Bias Calibration Value Position */
#define ADC_CALIB_BIAS_CAL_Msk (_UINT16_(0x7) << ADC_CALIB_BIAS_CAL_Pos) /* (ADC_CALIB) Bias Calibration Value Mask */
#define ADC_CALIB_BIAS_CAL(value)                                                                                      \
        (ADC_CALIB_BIAS_CAL_Msk &                                                                                      \
         (_UINT16_(value) << ADC_CALIB_BIAS_CAL_Pos)) /* Assigment of value for BIAS_CAL in the ADC_CALIB register */
#define ADC_CALIB_Msk _UINT16_(0x07FF) /* (ADC_CALIB) Register Mask  */


