ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/adc.h
/* -------- ADC_DBGCTRL : (ADC Offset: 0x2A) (R/W 8) Debug Control -------- */
#define ADC_DBGCTRL_RESETVALUE _UINT8_(0x00) /*  (ADC_DBGCTRL) Debug Control  Reset Value */

#define ADC_DBGCTRL_DBGRUN_Pos _UINT8_(0) /* (ADC_DBGCTRL) Debug Run Position */
#define ADC_DBGCTRL_DBGRUN_Msk (_UINT8_(0x1) << ADC_DBGCTRL_DBGRUN_Pos) /* (ADC_DBGCTRL) Debug Run Mask */
#define ADC_DBGCTRL_DBGRUN(value)                                                                                      \
        (ADC_DBGCTRL_DBGRUN_Msk &                                                                                      \
         (_UINT8_(value) << ADC_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the ADC_DBGCTRL register */
#define ADC_DBGCTRL_Msk _UINT8_(0x01) /* (ADC_DBGCTRL) Register Mask  */


/** \brief ADC register offsets definitions */
#define ADC_CTRLA_REG_OFST _UINT32_(0x00) /* (ADC_CTRLA) Control A Offset */
#define ADC_REFCTRL_REG_OFST _UINT32_(0x01) /* (ADC_REFCTRL) Reference Control Offset */
#define ADC_AVGCTRL_REG_OFST _UINT32_(0x02) /* (ADC_AVGCTRL) Average Control Offset */
#define ADC_SAMPCTRL_REG_OFST _UINT32_(0x03) /* (ADC_SAMPCTRL) Sampling Time Control Offset */
#define ADC_CTRLB_REG_OFST _UINT32_(0x04) /* (ADC_CTRLB) Control B Offset */
#define ADC_WINCTRL_REG_OFST _UINT32_(0x08) /* (ADC_WINCTRL) Window Monitor Control Offset */
#define ADC_SWTRIG_REG_OFST _UINT32_(0x0C) /* (ADC_SWTRIG) Software Trigger Offset */
#define ADC_INPUTCTRL_REG_OFST _UINT32_(0x10) /* (ADC_INPUTCTRL) Input Control Offset */
#define ADC_EVCTRL_REG_OFST _UINT32_(0x14) /* (ADC_EVCTRL) Event Control Offset */
#define ADC_INTENCLR_REG_OFST _UINT32_(0x16) /* (ADC_INTENCLR) Interrupt Enable Clear Offset */
#define ADC_INTENSET_REG_OFST _UINT32_(0x17) /* (ADC_INTENSET) Interrupt Enable Set Offset */
#define ADC_INTFLAG_REG_OFST _UINT32_(0x18) /* (ADC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define ADC_STATUS_REG_OFST _UINT32_(0x19) /* (ADC_STATUS) Status Offset */
#define ADC_RESULT_REG_OFST _UINT32_(0x1A) /* (ADC_RESULT) Result Offset */
#define ADC_WINLT_REG_OFST _UINT32_(0x1C) /* (ADC_WINLT) Window Monitor Lower Threshold Offset */
#define ADC_WINUT_REG_OFST _UINT32_(0x20) /* (ADC_WINUT) Window Monitor Upper Threshold Offset */
#define ADC_GAINCORR_REG_OFST _UINT32_(0x24) /* (ADC_GAINCORR) Gain Correction Offset */
#define ADC_OFFSETCORR_REG_OFST _UINT32_(0x26) /* (ADC_OFFSETCORR) Offset Correction Offset */
#define ADC_CALIB_REG_OFST _UINT32_(0x28) /* (ADC_CALIB) Calibration Offset */
#define ADC_DBGCTRL_REG_OFST _UINT32_(0x2A) /* (ADC_DBGCTRL) Debug Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ADC register API structure */
typedef struct { /* Analog Digital Converter */
        __IO uint8_t ADC_CTRLA; /**< Offset: 0x00 (R/W  8) Control A */
        __IO uint8_t ADC_REFCTRL; /**< Offset: 0x01 (R/W  8) Reference Control */
        __IO uint8_t ADC_AVGCTRL; /**< Offset: 0x02 (R/W  8) Average Control */
        __IO uint8_t ADC_SAMPCTRL; /**< Offset: 0x03 (R/W  8) Sampling Time Control */
        __IO uint16_t ADC_CTRLB; /**< Offset: 0x04 (R/W  16) Control B */
        __I uint8_t Reserved1[0x02];
        __IO uint8_t ADC_WINCTRL; /**< Offset: 0x08 (R/W  8) Window Monitor Control */
        __I uint8_t Reserved2[0x03];
        __IO uint8_t ADC_SWTRIG; /**< Offset: 0x0C (R/W  8) Software Trigger */
        __I uint8_t Reserved3[0x03];
        __IO uint32_t ADC_INPUTCTRL; /**< Offset: 0x10 (R/W  32) Input Control */
        __IO uint8_t ADC_EVCTRL; /**< Offset: 0x14 (R/W  8) Event Control */
        __I uint8_t Reserved4[0x01];
        __IO uint8_t ADC_INTENCLR; /**< Offset: 0x16 (R/W  8) Interrupt Enable Clear */
        __IO uint8_t ADC_INTENSET; /**< Offset: 0x17 (R/W  8) Interrupt Enable Set */
        __IO uint8_t ADC_INTFLAG; /**< Offset: 0x18 (R/W  8) Interrupt Flag Status and Clear */
        __I uint8_t ADC_STATUS; /**< Offset: 0x19 (R/   8) Status */
        __I uint16_t ADC_RESULT; /**< Offset: 0x1A (R/   16) Result */
        __IO uint16_t ADC_WINLT; /**< Offset: 0x1C (R/W  16) Window Monitor Lower Threshold */
        __I uint8_t Reserved5[0x02];
        __IO uint16_t ADC_WINUT; /**< Offset: 0x20 (R/W  16) Window Monitor Upper Threshold */
        __I uint8_t Reserved6[0x02];
        __IO uint16_t ADC_GAINCORR; /**< Offset: 0x24 (R/W  16) Gain Correction */
        __IO uint16_t ADC_OFFSETCORR; /**< Offset: 0x26 (R/W  16) Offset Correction */
        __IO uint16_t ADC_CALIB; /**< Offset: 0x28 (R/W  16) Calibration */
        __IO uint8_t ADC_DBGCTRL; /**< Offset: 0x2A (R/W  8) Debug Control */
} adc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_ADC_COMPONENT_H_ */
